from . import load, get, get2

img = load('base.png')

cfg_base = {
    100: get(img, 0, 0),  # 地面(可通行)
    101: get(img, 1, 0),  # 墙壁(不可通行)
    102: get2(img, 1),  # 岩浆(不可通行)
    103: get2(img, 2),  # 星空(不可通行)
    104: get(img, 0, 3),  # 上楼梯(去高一层)
    105: get(img, 1, 3),  # 下楼梯(去低一层)

    110: get(img, 0, 4),  # 黄钥匙(可打开黄门)
    111: get(img, 1, 4),  # 黄门(用黄钥匙打开)
    112: get(img, 0, 5),  # 蓝钥匙(可打开蓝门)
    113: get(img, 1, 5),  # 蓝门(用蓝钥匙打开)
    114: get(img, 0, 6),  # 红钥匙(可打开红门)
    115: get(img, 1, 6),  # 红门(用红钥匙打开)
    116: get(img, 0, 7),  # 栅栏门(可直接打开)
    117: get(img, 0, 7),  # 栅栏门(不可打开或事件触发)
    118: get(img, 1, 7),  # 二层特殊门(小偷事件触发)

    120: get(img, 0, 8),  # 铁剑(攻击+)
    121: get(img, 1, 8),  # 铁盾(防御+)
    122: get(img, 0, 9),  # 银剑(攻击+)
    123: get(img, 1, 9),  # 银盾(防御+)
    124: get(img, 0, 10),  # 金剑(攻击+)
    125: get(img, 1, 10),  # 金盾(防御+)
    126: get(img, 0, 11),  # 仙剑(攻击+)
    127: get(img, 1, 11),  # 仙盾(防御+)
    128: get(img, 0, 12),  # 圣剑(攻击+)
    129: get(img, 1, 12),  # 圣盾(防御+)

    130: get(img, 0, 13),  # 红宝石(攻击+3)
    131: get(img, 1, 13),  # 蓝宝石(防御+3)
    132: get(img, 0, 14),  # 红药水(血量+200)
    133: get(img, 1, 14),  # 蓝药水(血量+500)

    140: get(img, 0, 15),  # 圣光徽(可查看怪物属性)
    141: get(img, 1, 15),  # 传送门(可在已通过的楼层传送)
    142: get(img, 0, 16),  # 大金币(金币+300)
    143: get(img, 1, 16),  # 圣水瓶(血量翻倍)
    144: get(img, 0, 17),  # 钥匙盒(各色钥匙+1)
    145: get(img, 1, 17),  # 小飞羽()
    146: get2(img, 18),  # 大飞羽()
    147: get(img, 0, 19),  # 十字架()
    148: get(img, 1, 19),  # 红宝石锄头()

    150: get2(img, 20),  # 仙子
    151: get2(img, 21),  # 小偷
    152: get2(img, 22),  # 公主
    153: get2(img, 23),  # 5层白发老人
    154: get2(img, 23),  # 13层白发老人
    155: get2(img, 24),  # 5层红衣商人
    156: get2(img, 24),  # 12层红衣商人

    160: get2(img, 25),  # 3层商店
    161: get2(img, 25),  # 11层商店
    162: get(img, 0, 26),  # 商店左侧
    163: get(img, 1, 26),  # 商店右侧
}
